app/Models/Incoming/MasterData/MasterBinModel.php

    public function GetDetailDataSeat($binLocation) {
        return $this->db->table('table_bin')
            ->select('table_paletization.nomor_gr, table_paletization.total_qty,
            table_paletization.nama_barang, table_paletization.satuan_berat, table_bin.kode_pallet,
            table_bin.rack, table_bin.bin_location, table_bin.is_reserved, SUM(table_paletization.qty_dtg) AS total_qty,
            table_gr.satuan,table_gr.exp_date
            ')
            ->join('table_paletization', 'table_bin.pallet_id = table_paletization.id', 'inner')
            ->join('table_gr','table_paletization.gr_id = table_gr.id', 'inner')
            ->where('bin_location',$binLocation)
            ->get()
            ->getResult();
---
SELECT `table_paletization`.`nomor_gr`, `table_paletization`.`total_qty`, `table_paletization`.`nama_barang`, `table_paletization`.`satuan_berat`, `table_bin`.`kode_pallet`, `table_bin`.`rack`, `table_bin`.`bin_location`, `table_bin`.`is_reserved`, SUM(table_paletization.qty_dtg) AS total_qty, `table_gr`.`satuan`, `table_gr`.`exp_date`
FROM `table_bin`
INNER JOIN `table_paletization` ON `table_bin`.`pallet_id` = `table_paletization`.`id`
INNER JOIN `table_gr` ON `table_paletization`.`gr_id` = `table_gr`.`id`
WHERE `bin_location` = '1'