app/Models/Incoming/MasterData/MasterPOModel.php

SELECT COUNT(*) AS `numrows`
FROM `table_gr`
WHERE `nomor_po` = 'TEST.PO.2024.04.0003'
AND `kode` IS NULL
AND status_gr IS NOT NULL
SELECT `table_po`.`nomor_po`, `table_po`.`nama_barang`, `table_po`.`qty_po`, `table_po`.`kode`, `table_po`.`supplier`, `table_po`.`satuan`, `table_gr`.`status_gr`, `table_po`.`tanggal_po`
FROM `table_po`
LEFT JOIN `table_gr` ON `table_gr`.`po_id` = `table_po`.`id`
WHERE `table_po`.`nomor_po` = 'TEST.PO.2024.04.0003'
---
    public function GetBarangByPO($nomor_po,$kode) {
        $hasStatusGr = $this->db->table('table_gr')
                            ->select('status_gr')
                            ->where('nomor_po', $nomor_po)
                            ->where('kode',$kode)
                            ->where('status_gr IS NOT NULL', null, false)
                            ->countAllResults();

    if ($hasStatusGr > 0) {

        return $this->db->table('table_po')
            ->select('table_po.tanggal_po ,table_gr.id, table_gr.nama_barang, table_gr.nomor_po, table_gr.supplier, SUM(table_gr.qty_po) AS qty_po, table_gr.tanggal_po, table_gr.kode, SUM(table_gr.qty_dtg) AS qty_dtg, table_gr.status_gr, table_gr.satuan', false)
            ->where('table_gr.nomor_po', $nomor_po)
            ->where('kode',$kode)
            ->join('table_gr', 'table_gr.po_id = table_po.id', 'inner')
            ->groupBy('table_gr.kode')
            ->get()
            ->getResult();
    } else {
        return $this->db->table('table_po')
        ->select('table_po.nomor_po, table_po.nama_barang, table_po.qty_po, table_po.kode, table_po.supplier, table_po.satuan, table_gr.status_gr, table_po.tanggal_po')
        ->where('table_po.nomor_po', $nomor_po)
        ->join('table_gr', 'table_gr.po_id = table_po.id', 'left')
        ->get()
        ->getResult();

SELECT table_gr.id, table_gr.nama_barang, table_gr.nomor_po, table_gr.supplier, SUM(table_gr.qty_po) AS qty_po, table_gr.tanggal_po, table_gr.kode, SUM(table_gr.qty_dtg) AS qty_dtg, table_gr.status_gr, table_gr.satuan
FROM `table_po`
INNER JOIN `table_gr` ON `table_gr`.`po_id` = `table_po`.`id`
GROUP BY `table_gr`.`kode`
---
    public function GetMultiTableData()
    {
        return $this->db->table('table_po')
        ->select('table_gr.id, table_gr.nama_barang, table_gr.nomor_po, table_gr.supplier, SUM(table_gr.qty_po) AS qty_po, table_gr.tanggal_po, table_gr.kode, SUM(table_gr.qty_dtg) AS qty_dtg, table_gr.status_gr, table_gr.satuan', false)
        ->join('table_gr', 'table_gr.po_id = table_po.id', 'inner')
        ->groupBy('table_gr.kode')
        ->get()
        ->getResult();

SELECT `nomor_po`, `kode`, `supplier`, `nama_barang`, `satuan`, `qty_po`
FROM `table_po`
WHERE `nomor_po` = 'TEST.PO.2024.04.0003'
GROUP BY `kode`
---
    public function GetBarangQCByPO($nomor_po) {
        return $this->db->table('table_po')
        ->select('nomor_po,kode,supplier,nama_barang, satuan, qty_po')
        ->where('nomor_po',$nomor_po)
        ->groupBy('kode')
        ->get()
        ->getResult();