app/Models/Incoming/MasterData/MasterPaletizationModel.php

    public function KodeOtomatisPallet() {
        $builder = $this->table('table_paletization');
        $builder->selectMax('nomor_gr','nomor_grMax');
        $query = $builder->get()->getResult();
---
SELECT MAX(`nomor_gr`) AS `nomor_grMax`
FROM `table_paletization`

    public function GetDetailBarangPallet($binLocation){
        return $this->db->table('table_bin')
            ->select('table_bin.kode_pallet, table_bin.rack, table_bin.bin_location, table_paletization.nama_barang, table_paletization.total_qty, table_paletization.satuan_berat', false)
            ->join('table_paletization','table_bin.pallet_id = table_bin.id','inner')
            ->where('bin_location',$binLocation)
            ->get()
            ->getResult();
---
SELECT table_bin.kode_pallet, table_bin.rack, table_bin.bin_location, table_paletization.nama_barang, table_paletization.total_qty, table_paletization.satuan_berat
FROM `table_bin`
INNER JOIN `table_paletization` ON `table_bin`.`pallet_id` = `table_bin`.`id`
WHERE `bin_location` = '1'