app/Models/Incoming/MasterData/MasterGRModel.php

    function KodeOtomatisGR() {
        $builder = $this->table('table_gr');
        $builder->selectMax('nomor_gr', 'nomor_grMax');
        $query = $builder->get()->getResult();
---
SELECT MAX(`nomor_gr`) AS `nomor_grMax`
FROM `table_gr`

    function KodeOtomatisKodeBatch() {
        $builder = $this->table('table_gr');
        $builder->selectMax('kode_batch','kode_batchMax');
        $query = $builder->get()->getResult();
---
SELECT MAX(`kode_batch`) AS `kode_batchMax`
FROM `table_gr`

    function KodeOtomatisPRD() {
        $builder = $this->table('table_gr');
        $builder->selectMax('kode_prd','kode_prdMax');
        $query = $builder->get()->getResult();
---
SELECT MAX(`kode_prd`) AS `kode_prdMax`
FROM `table_gr`

   public function isPOFullFiled($nomor_po) {
    // Check if there are any outstanding items for the given PO
    $outstandingCount = $this->db->table('table_gr') // Replace 'your_table_name' with the actual table name
                                 ->select('COUNT(*) as count')
                                 ->where('nomor_po', $nomor_po)
                                 ->where('status_gr', 'outstanding')
                                 ->get()
                                 ->getRow()
                                 ->count;

    // Check if there are any fulfilled items for the given PO
    $fulfilledCount = $this->db->table('table_gr') // Replace 'your_table_name' with the actual table name
                               ->select('COUNT(*) as count')
                               ->where('nomor_po', $nomor_po)
                               ->where('status_gr', 'fulfilled')
                               ->get()
                               ->getRow()
                               ->count;
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT COUNT(*) as count
FROM `table_gr`
WHERE `nomor_po` = 'TEST.PO.2024.04.0010'
AND `status_gr` = 'outstanding'
GROUP BY `nomor_po`
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM (
SELECT COUNT(*) as count
FROM `table_gr`
WHERE `nomor_po` = 'TEST.PO.2024.04.0010'
AND `status_gr` = 'fullfiled'
GROUP BY `nomor_po`
) CI_count_all_results

    public function getDataQtyDtg($nomor_po) {
        return $this->db->table('table_gr') // primary table
            ->select('table_gr.id, table_gr.nama_barang, table_gr.nomor_po, table_gr.supplier, SUM(table_gr.qty_po) AS qty_po, table_gr.tanggal_po, table_gr.kode, SUM(table_gr.qty_dtg) AS qty_dtg, table_gr.status_gr, table_gr.satuan', false)
            ->where('table_gr.nomor_po', $nomor_po)
            ->join('table_po', 'table_po.id = table_gr.po_id', 'inner') // joining with table_po
            ->groupBy('table_gr.kode')
            ->get()
            ->getResult();
---
SELECT table_gr.id, table_gr.nama_barang, table_gr.nomor_po, table_gr.supplier, SUM(table_gr.qty_po) AS qty_po, table_gr.tanggal_po, table_gr.kode, SUM(table_gr.qty_dtg) AS qty_dtg, table_gr.status_gr, table_gr.satuan
FROM `table_gr`
INNER JOIN `table_po` ON `table_po`.`id` = `table_gr`.`po_id`
WHERE `table_gr`.`nomor_po` = 'TEST.PO.2024.04.0004'
GROUP BY `table_gr`.`kode`