app/Controllers/Incoming/Form/FormGRController.php

    public function FormGoodReceive(){
        $pemasok = $this->request->getGet('pemasok');
        $dataPO = new MasterPOModel();
        $dataWarehouse =  new MasterWarehouseModel();
        $dataSupplier = new MasterSupplierModel();
        $dataGR = new MasterGRModel();
        $data['master_po'] = $dataPO->get()->getResultArray();
        $data['master_warehouse'] = $dataWarehouse->findAll();
---
SELECT *
FROM `master_warehouse`