app/Controllers/Incoming/Form/FormBINController.php

SELECT *
FROM `master_bin_location`
---
public function DisplayBINStatus() {
    $binModel = new MasterBinModel();
    $binLocationModel = new MasterBINLocationModel();
    $data['master_bin_location'] = $binLocationModel->findAll();