app/Controllers/Incoming/Form/FormQCController.php

SELECT *
FROM `master_warehouse`
---
    public function index()
    {
        $dataPO = new MasterPOModel();
        $dataWarehouse =  new MasterWarehouseModel();
        $dataSupplier = new MasterSupplierModel();
        $dataGR = new MasterGRModel();
        $data['master_po'] = $dataPO->get()->getResultArray();
        $data['master_warehouse'] = $dataWarehouse->findAll();