app/Controllers/Incoming/Form/FormIdentitasPalletController.php

SELECT *
FROM `master_supplier`
---
    public function FormIdentitasPallet() {
        $dataSupplier = new MasterSupplierModel();
        $dataGR = new MasterGRModel();
        $data['master_supplier'] = $dataSupplier->findAll();